<?php

use App\Models\Booth;
use Faker\Generator as Faker;

$factory->define(Booth::class, function (Faker $faker) {
    return [
        'title' => $faker->randomElement([
            'غرفه-۱',
            'غرفه-۲',
            'غرفه-۳',
            'غرفه-۴',
            'غرفه-۵',
        ]),
        'description' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'seller_id' => App\Models\Seller::inRandomOrder()->first()->id,
        'logo' => 'http://lorempixel.com/400/200/',
        'category_id' => App\Models\Category::inRandomOrder()->first()->id,
    ];
});
