<?php

use App\Models\Seller;
use Faker\Generator as Faker;
use App\Models\State;
use App\Models\City;

$factory->define(Seller::class, function (Faker $faker) {
    return [
        'name' => $faker->randomElement([
            'فروشنده-۱',
            'فروشنده-۲',
            'فروشنده-۳',
            'فروشنده-۴',
            'فروشنده-۵',
        ]),
        'profile_picture' => 'http://lorempixel.com/400/200/',
        'gallery' => ['http://lorempixel.com/400/200/', 'http://lorempixel.com/400/200/'],
        'story' => 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها و شرایط سخت تایپ به پایان رسد وزمان مورد نیاز شامل حروفچینی دستاوردهای اصلی و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.',
        'state_id' => State::inRandomOrder()->first()->id,
        'city_id' => City::inRandomOrder()->first()->id,
    ];
});
